# Books (Core)
- Alexis Deviney
- 4/17/2022

## Part 1) ERD

![png](books_ERD.png)

## Part 2) Create Database in Python

In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
connection_str = "mysql+pymysql://root:root@localhost/books"

In [2]:
engine = create_engine(connection_str)

In [3]:
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

In [4]:
users = pd.read_csv('users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [13]:
users.to_sql('users', engine, if_exists = 'replace')

In [9]:
books = pd.read_csv('books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [10]:
books.to_sql('books', engine, if_exists = 'replace')

In [6]:
authors = pd.read_csv('authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [11]:
authors.to_sql('authors', engine, if_exists = 'replace')

In [7]:
favorites = pd.read_csv('favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [12]:
favorites.to_sql('favorites', engine, if_exists = 'replace')

**Testing the database**

In [14]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

Write a query at the end of your Jupyter Notebook to list the titles of all of John Doe's favorite books.

In [17]:
q = """
SELECT b.title
FROM books b JOIN favorites f ON b.id = f.book_id
WHERE f.user_id = (SELECT u.id FROM users u 
					WHERE u.first_name = "John" AND u.last_name = "Doe")
"""
pd.read_sql(q, engine)

              title
0       The Shining
1                It
2  The Great Gatsby